Revit 2026 API

# DirectShapeTypeSetOptions Method

---

Sets the options to use for this DirectShapeType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetOptions(
	DirectShapeTypeOptions options
)
```
```vb
Public Sub SetOptions (
	options As DirectShapeTypeOptions
)
```
```cpp
public:
void SetOptions(
	DirectShapeTypeOptions^ options
)
```
```fsharp
member SetOptions :
        options : DirectShapeTypeOptions -> unit
```

#### Parameters

options DirectShapeTypeOptions
     Options to use for this DirectShapeType.

| Exception | Condition |
| --- | --- |
| ArgumentException | The DirectShapeTypeOptions provided are not valid for this DirectShapeType. |
| ArgumentNullException | A non-optional argument was null |

The new options take effect immediately.

#### Reference

DirectShapeType Class

Autodesk.Revit.DB Namespace